Revit 2024 API
TessellatedShapeBuilderOutcome Enumeration
 Describes the outcome of TessellatedShapeBuilder attempt to build geometrical objects.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public enum TessellatedShapeBuilderOutcome
Visual Basic
Public Enumeration TessellatedShapeBuilderOutcome
Visual C++
public enum class TessellatedShapeBuilderOutcome
Members
Member name | Description
Mesh |  A mesh was created
Mixed |  A geometry and a mesh were created
Nothing |  Nothing was built.
Solid |  A solid geometry was created.
Sheet |  An open sheet was created.
See Also
Autodesk.Revit.DB Namespace